{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 16, 32, 1], "input_dtype": "float32", "name": "lambda_2", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-dfceafe7785e>\u00da\b<lambda><\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "trainable": true, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "nb_filter": 2, "W_constraint": null, "name": "convolution2d_6", "activation": "elu", "nb_col": 3, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [4, 4], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [4, 4]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_5", "activation": "linear", "input_dim": 42, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null, "trainable": true}}], "keras_version": "1.2.1"}